; domain
;credit: As defined in the book 'An Introduction to the Planning Domain Deﬁnition Language' (Patrik Haslum)
(define (domain knights-tour)
    (:requirements :typing :negative-preconditions :equality)
    (:types
        location - object
        figure - object
    )
    (:predicates
        (at ?knight - figure ?col ?row - location)
        (visited ?col ?row - location)
        (diff_by_one ?col ?row - location)
        (diff_by_two ?col ?row - location)
    )

    (:action move_2col_1row
        :parameters (?knight1 ?knight2 - figure ?from_col ?from_row ?to_col ?to_row - location)
        :precondition (and (at ?knight1 ?from_col ?from_row)
                           (diff_by_two ?from_col ?to_col) ; col +/- 2
                           (diff_by_one ?from_row ?to_row) ; row +/- 1
                           (not (visited ?to_col ?to_row))
                           (not (at ?knight2 ?to_col ?to_row))
                           (not (at ?knight1 ?to_col ?to_row))
                           (not (= ?knight1 ?knight2))
                      )
        :effect (and (not (at ?knight1 ?from_col ?from_row))
                     (at ?knight1 ?to_col ?to_row)
                     (visited ?to_col ?to_row))
    )
    (:action move_2row_1col
        :parameters (?knight1 ?knight2 - figure ?from_col ?from_row ?to_col ?to_row - location)
        :precondition (and (at ?knight1 ?from_col ?from_row)
                           (diff_by_two ?from_row ?to_row) ; row +/- 2
                           (diff_by_one ?from_col ?to_col) ; col +/- 1
                           (not (visited ?to_col ?to_row))
                           (not (at ?knight2 ?to_col ?to_row))
                           (not (at ?knight1 ?to_col ?to_row))
                           (not (= ?knight1 ?knight2))
                           )
        :effect (and (not (at ?knight1 ?from_col ?from_row))
                     (at ?knight1 ?to_col ?to_row)
                     (visited ?to_col ?to_row))
    )
)

; problem
;credit: Single knight problem as defined in the book 'An Introduction to the Planning Domain Deﬁnition Language' (Patrik Haslum)
(define (problem knights-tour-problem-8x8)
    (:domain knights-tour)
    (:objects
        n1 n2 n3 n4 n5 -  location
        knight_b1 knight_b2 - figure
    )
    (:init
        ;Initial position of the Knight piece (upper left corner) => (n1 n8) = A8
        (at knight_b1 n1 n5)
        (at knight_b2 n2 n5)
        (visited n1 n5)
        (visited n2 n5)
        ; Here, we have to list all instances of the static predicates diff_by_two and diff_by_one:
		;Difference by one:
		(diff_by_one n1 n2)
		(diff_by_one n2 n1)
		(diff_by_one n2 n3)
		(diff_by_one n3 n2)
		(diff_by_one n3 n4)
		(diff_by_one n4 n3)
		(diff_by_one n4 n5)
		(diff_by_one n5 n4)
		;Difference by two:
		(diff_by_two n1 n3)
		(diff_by_two n3 n1)
		(diff_by_two n2 n4)
		(diff_by_two n4 n2)
		(diff_by_two n3 n5)
		(diff_by_two n5 n3)
    )
    (:goal (and
				(visited n1 n1)
				(visited n1 n2)
				(visited n1 n3)
				(visited n1 n4)
				(visited n1 n5)
				(visited n2 n1)
				(visited n2 n2)
				(visited n2 n3)
				(visited n2 n4)
				(visited n2 n5)
				(visited n3 n1)
				(visited n3 n2)
				(visited n3 n3)
				(visited n3 n4)
				(visited n3 n5)
				(visited n4 n1)
				(visited n4 n2)
				(visited n4 n3)
				(visited n4 n4)
				(visited n4 n5)
				(visited n5 n1)
				(visited n5 n2)
				(visited n5 n3)
				(visited n5 n4)
				(visited n5 n5)
           )
    )
)

; plan
1. (move_2row_1col knight_b2 knight_b1 n2 n5 n3 n3)
   deleted: (at knight_b2 n2 n5)
   added: (at knight_b2 n3 n3) (visited n3 n3)
   goals met: 3 of 25
2. (move_2row_1col knight_b1 knight_b2 n1 n5 n2 n3)
   deleted: (at knight_b1 n1 n5)
   added: (at knight_b1 n2 n3) (visited n2 n3)
   goals met: 4 of 25
3. (move_2row_1col knight_b1 knight_b2 n2 n3 n1 n1)
   deleted: (at knight_b1 n2 n3)
   added: (at knight_b1 n1 n1) (visited n1 n1)
   goals met: 5 of 25
4. (move_2col_1row knight_b1 knight_b2 n1 n1 n3 n2)
   deleted: (at knight_b1 n1 n1)
   added: (at knight_b1 n3 n2) (visited n3 n2)
   goals met: 6 of 25
5. (move_2col_1row knight_b1 knight_b2 n3 n2 n5 n1)
   deleted: (at knight_b1 n3 n2)
   added: (at knight_b1 n5 n1) (visited n5 n1)
   goals met: 7 of 25
6. (move_2row_1col knight_b1 knight_b2 n5 n1 n4 n3)
   deleted: (at knight_b1 n5 n1)
   added: (at knight_b1 n4 n3) (visited n4 n3)
   goals met: 8 of 25
7. (move_2col_1row knight_b1 knight_b2 n4 n3 n2 n2)
   deleted: (at knight_b1 n4 n3)
   added: (at knight_b1 n2 n2) (visited n2 n2)
   goals met: 9 of 25
8. (move_2row_1col knight_b1 knight_b2 n2 n2 n1 n4)
   deleted: (at knight_b1 n2 n2)
   added: (at knight_b1 n1 n4) (visited n1 n4)
   goals met: 10 of 25
9. (move_2col_1row knight_b1 knight_b2 n1 n4 n3 n5)
   deleted: (at knight_b1 n1 n4)
   added: (at knight_b1 n3 n5) (visited n3 n5)
   goals met: 11 of 25
10. (move_2col_1row knight_b1 knight_b2 n3 n5 n5 n4)
   deleted: (at knight_b1 n3 n5)
   added: (at knight_b1 n5 n4) (visited n5 n4)
   goals met: 12 of 25
11. (move_2row_1col knight_b1 knight_b2 n5 n4 n4 n2)
   deleted: (at knight_b1 n5 n4)
   added: (at knight_b1 n4 n2) (visited n4 n2)
   goals met: 13 of 25
12. (move_2col_1row knight_b1 knight_b2 n4 n2 n2 n1)
   deleted: (at knight_b1 n4 n2)
   added: (at knight_b1 n2 n1) (visited n2 n1)
   goals met: 14 of 25
13. (move_2row_1col knight_b1 knight_b2 n2 n1 n1 n3)
   deleted: (at knight_b1 n2 n1)
   added: (at knight_b1 n1 n3) (visited n1 n3)
   goals met: 15 of 25
14. (move_2col_1row knight_b1 knight_b2 n1 n3 n3 n4)
   deleted: (at knight_b1 n1 n3)
   added: (at knight_b1 n3 n4) (visited n3 n4)
   goals met: 16 of 25
15. (move_2col_1row knight_b1 knight_b2 n3 n4 n5 n5)
   deleted: (at knight_b1 n3 n4)
   added: (at knight_b1 n5 n5) (visited n5 n5)
   goals met: 17 of 25
16. (move_2row_1col knight_b2 knight_b1 n3 n3 n4 n1)
   deleted: (at knight_b2 n3 n3)
   added: (at knight_b2 n4 n1) (visited n4 n1)
   goals met: 18 of 25
17. (move_2row_1col knight_b2 knight_b1 n4 n1 n5 n3)
   deleted: (at knight_b2 n4 n1)
   added: (at knight_b2 n5 n3) (visited n5 n3)
   goals met: 19 of 25
18. (move_2row_1col knight_b2 knight_b1 n5 n3 n4 n5)
   deleted: (at knight_b2 n5 n3)
   added: (at knight_b2 n4 n5) (visited n4 n5)
   goals met: 20 of 25
19. (move_2col_1row knight_b2 knight_b1 n4 n5 n2 n4)
   deleted: (at knight_b2 n4 n5)
   added: (at knight_b2 n2 n4) (visited n2 n4)
   goals met: 21 of 25
20. (move_2row_1col knight_b2 knight_b1 n2 n4 n1 n2)
   deleted: (at knight_b2 n2 n4)
   added: (at knight_b2 n1 n2) (visited n1 n2)
   goals met: 22 of 25
21. (move_2col_1row knight_b2 knight_b1 n1 n2 n3 n1)
   deleted: (at knight_b2 n1 n2)
   added: (at knight_b2 n3 n1) (visited n3 n1)
   goals met: 23 of 25
22. (move_2col_1row knight_b2 knight_b1 n3 n1 n5 n2)
   deleted: (at knight_b2 n3 n1)
   added: (at knight_b2 n5 n2) (visited n5 n2)
   goals met: 24 of 25
23. (move_2row_1col knight_b2 knight_b1 n5 n2 n4 n4)
   deleted: (at knight_b2 n5 n2)
   added: (at knight_b2 n4 n4) (visited n4 n4)
   goals met: 25 of 25
